app/views/user/index.html.erb

SELECT "customers".* FROM "customers"
SELECT COUNT(*) FROM "customers"
---
<h2> User statistics </h2>
<p> Total Number of users in the system = <%= Customer.count - 1%> </p>