app/controllers/bookings_controller.rb

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "bookings" ("customer_id", "destination", "ride_id", "driverphn", "carno", "cartype", "seatsleft", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "rides" SET "seatsleft" = $1, "updated_at" = $2 WHERE "rides"."id" = $3  [["seatsleft", 4], ["updated_at", "2018-12-02 10:09:32.543632"], ["id", 5]]
---
  def create
    @booking = Booking.new(booking_params)
    @ride = Ride.find booking_params[:ride_id]

    #logger = Logger.new STDOUT
    #logger.info "LALLALALAAL"
    seatsleft =  @ride.seatsleft
    respond_to do |format|
      if @booking.save
        @ride.seatsleft = seatsleft -1
        @ride.save

DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 1]]
---
  def destroy
    @booking.destroy