app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
UPDATE "customers" SET "ban" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["ban", true], ["updated_at", "2018-11-06 17:01:59.784699"], ["id", 67]]
---
  def ban
    @customers = Customer.find(params[:id])
    @customers[:ban] = true
    respond_to do |format|
      if @customers.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
UPDATE "customers" SET "ban" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["ban", false], ["updated_at", "2018-11-06 17:16:51.318574"], ["id", 67]]
---
  def unban
    @customers = Customer.find(params[:id])
    @customers[:ban] = false
    respond_to do |format|
      if @customers.save

INSERT INTO "customers" ("name", "role", "created_at", "updated_at", "email", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save