app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hi"], ["customer_id", 67], ["created_at", "2018-11-11 18:02:55.487627"], ["updated_at", "2018-11-11 18:02:55.487627"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save