app/controllers/ps2_controller.rb

  def search
    if params[:search].blank?
    redirect_to(root_path, alert: "Empty field!") and return
  else
    @parameter = params[:search].downcase
    puts @quote_db
    @results = Quotation.where('lower(quote) LIKE :search OR lower(author_name) LIKE :search', search: "%#{@parameter}%")
    @results = @results.where.not(id: cookies[:id].split(" "))
---
SELECT "quotations".* FROM "quotations" WHERE (lower(quote) LIKE '%raunak%' OR lower(author_name) LIKE '%raunak%')
SELECT "quotations".* FROM "quotations"

  def quotations
    if cookies.permanent[:id] ==""
      cookies.permanent[:id] = "a"
    end
    if params[:quotation]
      @quotation = Quotation.new( params.require(:quotation).permit(:author_name,:category,:quote) )
      if @quotation.save
        flash[:notice] = 'Quotation was successfully created.'
        @quotation = Quotation.new
      end
    else
            @quotation = Quotation.new
    end
    puts(cookies[:id].split(" "))
    @quotations1 = Quotation.where.not(id: cookies[:id].split(" "))
    if params[:sort_by] == "date"
      if params[:store]
        @quotations = Quotation.where("lower(quote) LIKE ? OR lower(author_name) LIKE ?", "%#{params[:store]}%", "%#{params[:store]}%").order(:created_at)
      else
        @quotations = Quotation.order(:created_at)
      end

    else
      if params[:store]
        @quotations = Quotation.where("lower(quote) LIKE ? OR lower(author_name) LIKE ?", "%#{params[:store]}%", "%#{params[:store]}%").order(:category)
      else
        @quotations = Quotation.order(:category)
---
INSERT INTO "quotations" ("author_name", "category", "quote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "ajj"], ["category", "karan"], ["quote", "wkqwkq"], ["created_at", "2018-10-18 11:38:01.789367"], ["updated_at", "2018-10-18 11:38:01.789367"]]
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."created_at" ASC
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."category" ASC

  def export_to_json
    @quot = Quotation.all
---
SELECT "quotations".* FROM "quotations"