app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"

  def create
    @ride = Ride.new(ride_params)

    respond_to do |format|
      if @ride.save
---
INSERT INTO "rides" ("carno", "cartype", "driverphn", "seats", "time", "complete", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["carno", "1"], ["cartype", "car"], ["driverphn", 12], ["seats", 2], ["time", "a"], ["complete", false], ["created_at", "2018-12-01 10:35:24.648994"], ["updated_at", "2018-12-01 10:35:24.648994"]]

  def destroy
    @ride.destroy
---
DELETE FROM "rides" WHERE "rides"."id" = $1  [["id", 1]]

    def set_ride
      @ride = Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]