app/views/ps2/quotations.html.erb


      <%= form.select :category,  Quotation.select(:category).map(&:category).uniq  %>
---
SELECT "quotations"."category" FROM "quotations"